trade_exp/src/DataProcessors/РассылкаПисемОНачисленныхБонусныхБаллах/РассылкаПисемОНачисленныхБонусныхБаллах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РассылкаПисемОНачисленныхБонусныхБаллах</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3cba07e-b273-45b0-98b0-fb46a8dc5694">
  <name>БонусныеБаллы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="c272e1ef-3e78-4217-a586-b04d493ae9c7">
    <name>Начислено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="045d5c04-a494-4ce1-8feb-c971c832360d">
    <name>НачисленоСтатус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d25ef04e-457d-44fa-8725-25a813516807">
    <name>НачисленоКП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="372f8640-d32c-41d8-b10c-d2f1ae57a694">
    <name>НачисленоПрочее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d3b7c92b-14d3-4a4e-911a-d390d54c81e9">
    <name>КСписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1758d045-4e77-4376-b4b7-f8c4d0745f49">
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="eae49cfa-4bed-4293-959e-c0232deed12d">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="27ad958d-13f3-4ed5-bfe8-57104e687aa8">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ad6036-ba65-416c-b1ec-c8981b70ed01">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56c44fed-c51a-4f96-8f0e-631f22cadcde">
    <name>ДатаКОбработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d465f3dc-4b7b-40a0-970e-da046f213d6d">
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f1f1f3cd-c388-438a-8a49-8e43fd10ced8">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fef27478-ddfd-4ad9-8161-148761f29698">
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39cbda23-db3f-4ddd-8981-8540247406db">
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a6eb0cb1-80f0-4390-80ff-7af53f8e63c3">
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭлектронноеПисьмоИсходящее</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="97ec3768-2b7d-4032-a579-31ade741eb58">
    <name>ДатаКогдаОтправить</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0f6ea83-2849-4151-930d-692866919db3">
    <name>ОтправительПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2ee0d56b-cd7c-42db-8fb6-c1567fe1967d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de506523-241a-4845-9259-37066afbf16a">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="683861f9-9a5f-47db-8b03-959f839d5a3a">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e19aefe7-634d-4218-8d40-75802d1691e0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="edf11909-7d5f-4077-9cf1-90c3ef67cf64">
    <name>ДатаАктуальностиОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0510206f-eef0-4a5e-aeb7-d53c26d34adb">
    <name>ДатаОтправления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="cdd59b15-d67d-4f1b-90d4-595a9547e61d">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af5e1662-b91e-424b-8e69-e89337a96047">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/РассылкаПисемОНачисленныхБонусныхБаллах/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Проверить(Команда)
	ОтправитьПисьма();
КонецПроцедуры

Процедура ОтправитьПисьма() 
	ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Начало отправки писем");
	
	УчетнаяЗапись= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("tg-alterra22@yandex.ru", Истина);
	
	ВыборкаДетальныеЗаписи= ЗапросКБаллам();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Почта= ВыборкаДетальныеЗаписи.Почта;
		
		Если Не ПроверкаАдресаПочты(Почта) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстHTML= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТекстHTML").ПолучитьТекст();
		
		ТекстHTML= СтрЗаменить(ТекстHTML, "*КлиентФИО*", ВыборкаДетальныеЗаписи.КлиентФИО);
		
		Если ВыборкаДетальныеЗаписи.КоличествоПриход > 0 Тогда
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "На ваш счет начислено "+Строка(ВыборкаДетальныеЗаписи.КоличествоПриход) +" бонусов.");
		Иначе
		ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаНачисленоБаллов*", "");	
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.КоличествоРасход > 0 Тогда
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "С вашего счета списано "+Строка(ВыборкаДетальныеЗаписи.КоличествоРасход) +" бонусов.");
		Иначе
			ТекстHTML= СтрЗаменить(ТекстHTML, "*ФразаСписаниеБаллов*", "");	
		КонецЕсли;
		
		ТекстHTML= СтрЗаменить(ТекстHTML, "*Баланс*", Строка(ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток));
		
		СкрытаяПочта= "";
		СкрытаяПочта= "ryabushkina@tg-alterra.ru";
		
		//Создаем письмо
		Попытка
			Письмо=  Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
			Письмо.Дата= ТекущаяДата();
			Письмо.Автор= Пользователи.ТекущийПользователь();
			Письмо.Автор= ТекущаяДата();
			Письмо.Ответственный= Пользователи.ТекущийПользователь();
			Письмо.Важность= Перечисления.ВариантыВажностиВзаимодействия.Низкая;
			Письмо.Кодировка= "UTF-8"; 
			Письмо.ОтправительПредставление= "www.tg-alterra.ru - Интернет-магазин";
			Письмо.СписокПолучателейПисьма= Почта;
			Письмо.СписокПолучателейСкрытыхКопий= СкрытаяПочта;
			Письмо.СтатусПисьма= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
			Письмо.Текст= "";
			Письмо.ТекстHTML= ТекстHTML;
			Письмо.Тема= "Информация по бонусному счету";
			Письмо.ТипТекста= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			Письмо.УчетнаяЗапись= УчетнаяЗапись;
			Письмо.Комментарий= "Отправлено автоматически";
			
			НоваяСтрока = Письмо.ПолучателиПисьма.Добавить();
			НоваяСтрока.Представление = Почта;
			НоваяСтрока.Адрес = Почта;
			
			Если не ПустаяСтрока(СкрытаяПочта) Тогда
				НоваяСтрока = Письмо.ПолучателиСкрытыхКопий.Добавить();
				НоваяСтрока.Представление = СкрытаяПочта;
				НоваяСтрока.Адрес = СкрытаяПочта;
			КонецЕсли;
			
			Письмо.Записать();
			
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Отправлено письмо на адресс: "+Почта);
		Исключение
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Не удалось отправить письмо на адресс: "+Почта);
		КонецПопытки;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаПисемОНачисленныхБонусныхБаллах", УровеньЖурналаРегистрации.Примечание, , , "Окончание отправки писем");
КонецПроцедуры

Функция ЗапросКБаллам() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БонусныеБаллыОстаткиИОбороты.Партнер,
	|	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") КАК Почта,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоПриход) КАК КоличествоПриход,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоРасход) КАК КоличествоРасход,
	|	СУММА(БонусныеБаллыОстаткиИОбороты.НачисленоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование КАК КлиентФИО
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.ОстаткиИОбороты(&Дата1, , Регистратор, , ) КАК БонусныеБаллыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ПО БонусныеБаллыОстаткиИОбороты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
	|			И (&ТипПочта = ПартнерыКонтактнаяИнформация.Тип)
	|ГДЕ
	|	БонусныеБаллыОстаткиИОбороты.НачисленоОборот <> 0
	|	И ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """") <> """"
	|	И БонусныеБаллыОстаткиИОбороты.Регистратор.Дата МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеБаллыОстаткиИОбороты.Партнер,
	|	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.АдресЭП, """"),
	|	БонусныеБаллыОстаткиИОбороты.Партнер.Наименование";
	
	Запрос.УстановитьПараметр("ТипПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи= РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

Функция ПроверкаАдресаПочты(Почта)
	Если ПустаяСтрока(Почта) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мСтрок= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Почта, "@");
	Если мСтрок.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мСтрок2= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мСтрок[1], ".");
	Если мСтрок.Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если мСтрок.Количество() > 3 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
